/* Принимает на вход координаты точки (X и Y),
* причём X ≠ 0 и Y ≠ 0 и
* выдаёт номер координатной четверти плоскости,
* в которой находится эта точка.
*/

int x = 7657;
int y = -60;

if (x != 0 || y != 0){
    if (x > 0 && y > 0){
        Console.WriteLine("Точка находится в первой четверти.");
    } else if (x > 0 && y < 0){
        Console.WriteLine("Точка находится во второй четверти.");
    } else if (x < 0 && y < 0){
        Console.WriteLine("Точка находится в третьей четверти.");
    } else if (x < 0 && y > 0){
        Console.WriteLine("Точка находится в четвертой четверти.");
    } 
}
    